# Ultralytics YOLO 🚀, AGPL-3.0 license
# RT-DETR-l object detection model with P3-P5 outputs. For details see https://docs.ultralytics.com/models/rtdetr

# Parameters
nc: 6  # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-cls.yaml' will call yolov8-cls.yaml with scale 'n'
  # [depth, width, max_channels]
  l: [1.00, 1.00, 1024]

backbone:
  # [from, repeats, module, args]
  - [-1, 1, ConvNormLayer, [ 32, 3, 2, None, False, 'relu' ] ] # 0-P1/2
  - [-1, 1, ConvNormLayer, [ 32, 3, 1, None, False, 'relu' ] ] # 1
  - [-1, 1, ConvNormLayer, [ 64, 3, 1, None, False, 'relu' ] ] # 2
  - [-1, 1, nn.MaxPool2d, [3, 2, 1]] # 3-P2/4
  
  # [ch_out, block_type, block_nums, stage_num, act, variant]
  - [-1, 1, C2f_SMPCGLU, [128, 13]] # 4                       160*160
  - [-1, 1, Blocks, [128, BasicBlock, 2, 3, 'relu']] # 5-P3/8                 80*80
  - [-1, 1, Blocks, [256, BasicBlock, 2, 4, 'relu']]   # 6-P4/16            40*40
  - [-1, 1, Blocks, [512, BasicBlock_VSS, 2, 5, 'relu']] # 7-P5/32            20*20
head:
  - [ -1, 1, Conv, [ 256, 1, 1, None, 1, 1, False ] ]  # 8 input_proj.2
  - [-1, 1, TransformerEncoderLayer_DAttention, [1024]] # 9
  - [ -1, 1, Conv, [ 256, 1, 1 ] ]  # 10, Y5, lateral_convs.0                 20*20
  - [ [ 10,5,4 ], 1, DASI, [ 128 ] ] # 11-P4/16                   first FDASI    40*40
  - [ 11, 1, Conv, [ 128, 3, 2 ] ] # 12-P5/32                    first downsample
  - [ [ -1, 6], 1, Concat, [ 1 ] ] # 13
  - [-1, 3, DRBC3, [128, 0.5]] # 14-P5/32
  - [ -1, 1, Conv, [ 256, 3, 2,1] ]  #15
  - [ 11, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 16-P3/8     first upsample
  - [ [ -1, 4 ], 1, Concat, [ 1 ] ]#17
  - [-1, 3, DRBC3, [128, 0.5]]  # 18-P3/8
  - [ [ 15, 11, 18 ], 1, DASI, [ 128 ] ] # 19-P4/16               second FDASI
  - [ 19, 1, Conv, [ 128, 3, 2 ] ] # 20-P5/32                    second downsample
  - [ [ 12, 20, 14 ], 1, Concat, [ 1 ] ]
  - [-1, 3, DRBC3, [128, 0.5]]  # 22-P5/32
  - [ 19, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 23-P3/8     second upsample
  - [ [ 16, 23, 18 ], 1, Concat, [ 1 ] ]
  - [-1, 3, DRBC3, [128, 0.5]]  # 25-P3/8

  - [ [ 16,11,12 ], 1, ScalSeq, [ 128 ] ] # 26
  - [ [ 25, -1 ], 1, Add, [ ] ] # 27

  - [ -1, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 28
  - [ 4, 1, nn.Upsample, [ None, 2, 'nearest' ] ] # 29

  - [ [ -1, -2 ], 1, Concat, [ 1 ] ] # 30
  - [-1, 3, DRBC3, [128, 0.5]]  # 31
  - [ [ 29,27,19 ], 1, ScalSeq, [ 128 ] ] # 32
  - [ [ 31, -1 ], 1, Add, [ ] ] # 33

  - [ [ 25, 19, 22 ,33], 1, RTDETRDecoder, [ nc, 128, 300, 4, 8, 3 ] ]  # RTDETRDecoder(P3, P4, P5)